def reset_values_to_zero(data: dict) -> dict:
    """
    将字典中的所有 value 替换为字符串 "0"
    （支持嵌套字典和列表中的字典）
    """
    if isinstance(data, dict):
        return {k: reset_values_to_zero(v) for k, v in data.items()}
    elif isinstance(data, list):
        return [reset_values_to_zero(item) for item in data]
    else:
        return 0


waitougai_falan = {
    "换热器型号": "BEU",
    "壳程液柱密度": "1",  # 壳程液柱密度
    "管程液柱密度": "1",  # 管程液柱密度
    "壳程液柱静压力": "0",  # 壳程液柱静压力
    "管程液柱静压力": "0",  # 管程液柱静压力
    "压紧面形状序号": "1a",  # 外头盖垫片
    "法兰是否考虑腐蚀裕量": "是",
    "法兰压紧面压紧宽度ω": "0",  # 无
    "轴向外力": "0",  # 外头盖法兰 轴向拉伸载荷
    "外力矩": "0",  # 外头盖法兰 附加弯矩
    "法兰类型": "松式法兰4",  # 外头盖法兰
    "法兰材料类型": "",  # 外头盖法兰
    "法兰材料牌号": "",  # 法兰材料牌号
    "法兰材料腐蚀裕量": "3",  # 管程 #壳程
    "法兰颈部大端有效厚度": "26",  # 无
    "法兰颈部小端有效厚度": "16",  # 无
    "法兰名义内径": "1020",  # 壳程
    "法兰名义外径": "1300",  # 管程
    "法兰名义厚度": "65",  # 无
    "法兰颈部高度": "35",  # 无
    "覆层厚度": "0",  # 外头盖法兰
    "管程还是壳程": "壳程",  # 无
    "法兰为夹持法兰": "是",  # 无
    "法兰位置": "管箱法兰",  # 无
    "圆筒名义厚度": "10",  # 无
    "圆筒有效厚度": "8",  # 无
    "圆筒名义内径": "800",  # 壳程公称直径
    "圆筒名义外径": "1020",  # 管程公称直径
    "圆筒材料类型": "板材",  # 外头盖圆筒
    "圆筒材料牌号": "Q345R",  # 外头盖圆筒
    "焊缝高度": "0",  # 无
    "焊缝长度": "0",  # 无
    "焊缝深度": "0",  # 无
    "法兰种类": "整体法兰2",  # 外头盖法兰 法兰类型
    "公称直径管前左": "1000",  # 壳程
    "公称直径壳后右": "1200",  # 壳程 #外头盖圆筒内径
    "对接元件管前左材料类型": "板材",  # 壳体圆筒
    "对接元件壳后右材料类型": "板材",  # 外头盖圆筒
    "对接元件管前左材料牌号": "Q345R",  # 壳体圆筒
    "对接元件壳后右材料牌号": "Q345R",  # 外头盖圆筒
    "是否带分程隔板管前左": "是",  # 无
    "是否带分程隔板壳后右": "是",  # 无
    "法兰类型管前左": "整体法兰2",  # 壳体法兰 #外头盖侧法兰
    "法兰材料类型管前左": "",  # 壳体法兰 #外头盖侧法兰
    "法兰材料牌号管前左": "",  # 体法兰 #外头盖侧法兰
    "法兰材料腐蚀裕量管前左": "3",  # 壳程
    "法兰类型壳后右": "整体法兰2",  # 外头盖法兰
    "法兰材料类型壳后右": "",  # 外头盖法兰
    "法兰材料牌号壳后右": "",  # 外头盖法兰
    "法兰材料腐蚀裕量壳后右": "3",  # 壳程
    "覆层厚度管前左": "0",  # 壳体法兰 #外头盖侧法兰
    "覆层厚度壳后右": "0",  # 外头盖法兰
    "对接元件覆层厚度管前左": "1.5",  # 壳体圆筒
    "对接元件覆层厚度壳后右": "1.6",  # 外头盖圆筒
    "平盖序号": "9",  # 无
    "平盖直径": "1000",  # 壳程公称直径
    "纵向焊接接头系数": "1",  # 壳程
    "是否为圆形平盖": "是",  # 无
    "平盖材料类型": "钢锻件",  # 无
    "平盖材料牌号": "16Mn",  # 无
    "平盖分程隔板槽深度": "6",  # 无
    "平盖材料腐蚀裕量": "0.1",  # 无
    "平盖名义厚度": "96",  # 无
    "垫片名义外径": "0",  # 外头盖垫片，垫片名义外径D2n
    "垫片名义内径": "0",  # 外头盖垫片，垫片名义内径D1n
    "螺栓中心圆直径": "1200",  # 无
    "螺栓材料牌号": "35CrMo",  # 螺柱（外头盖法兰）
    "螺栓公称直径": "M16",  # 无
    "螺栓数量": "60",  # 无
    "螺栓根径": "0",  # 无
    # "垫片序号": "1", #无
    "垫片材料牌号": "复合柔性石墨波齿金属板(不锈钢)",  # 外头盖垫片
    "m": "3",  # 外头盖垫片，垫片系数m
    "y": "50",  # 外头盖垫片，垫片比压力y
    "垫片厚度": "3",  # 外头盖垫片
    "垫片有效外径": "0",
    "垫片有效内径": "0",
    "分程隔板与垫片接触面面积": "0",  # 无
    "垫片代号": "2.1",  # 无
    "隔条位置尺寸": "0",  # 布管，隔条位置尺寸
    "介质情况": "毒性",  # 壳程，介质特性（爆炸危险程度）+管程和壳程，介质特性（毒性危害程度）
    "垫片标准号": "GB/T 29463-2023",  # 外头盖垫片
    "垫片实际密封宽度": "0",  # 无
    "分程隔板槽宽度": ""  # 浮动管板，分程隔板槽宽
}

waitougaice_falan = {
    "换热器型号": "BEU",
    "壳程液柱密度": "1",  # 壳程液柱密度
    "管程液柱密度": "1",  # 管程液柱密度
    "壳程液柱静压力": "0",  # 壳程液柱静压力
    "管程液柱静压力": "0",  # 管程液柱静压力
    "压紧面形状序号": "1a",  # 外头盖侧垫片
    "法兰是否考虑腐蚀裕量": "是",  # 无
    "法兰压紧面压紧宽度ω": "0",  # 无
    "轴向外力": "0",  # 外头盖侧法兰，轴向拉伸载荷
    "外力矩": "0",  # 外头盖侧法兰，附加弯矩
    "法兰类型": "松式法兰4",  # 外头盖测法兰
    "法兰材料类型": "",  # 外头盖测法兰
    "法兰材料牌号": "",  # 外头盖测法兰
    "法兰材料腐蚀裕量": "3",  # 管程
    "法兰颈部大端有效厚度": "26",  # 无
    "法兰颈部小端有效厚度": "16",  # 无
    "法兰名义内径": "0",  # 公称直径，壳程
    "法兰名义外径": "0",  # 公称直径，管程
    "法兰名义厚度": "65",  # 无
    "法兰颈部高度": "35",  # 无
    "覆层厚度": "0",  # 外头盖测法兰
    "管程还是壳程": "管程",  # 无
    "法兰为夹持法兰": "是",  # 无
    "法兰位置": "管箱法兰",  # 无
    "圆筒名义厚度": "10",  # 无
    "圆筒有效厚度": "8",  # 无
    "圆筒名义内径": "800",  # 壳程公称直径
    "圆筒名义外径": "1020",  # 管程公称直径
    "圆筒材料类型": "板材",  # 外头盖圆筒
    "圆筒材料牌号": "Q345R",  # 外头盖圆筒
    "焊缝高度": "0",  # 无
    "焊缝长度": "0",  # 无
    "焊缝深度": "0",  # 无
    "法兰种类": "整体法兰2",  # 外头盖侧法兰，法兰类型
    "公称直径管前左": "1000",  # 壳程
    "公称直径壳后右": "1200",  # 壳程
    "对接元件管前左材料类型": "板材",  # 壳体圆筒
    "对接元件壳后右材料类型": "板材",  # 外头盖圆筒
    "对接元件管前左材料牌号": "Q345R",  # 壳体圆筒
    "对接元件壳后右材料牌号": "Q345R",  # 外头盖圆筒
    "是否带分程隔板管前左": "是",  # 无
    "是否带分程隔板壳后右": "是",  # 无
    "法兰类型管前左": "整体法兰2",  # 壳体法兰 #外头盖侧法兰
    "法兰材料类型管前左": "",  # 壳体法兰 #外头盖侧法兰
    "法兰材料牌号管前左": "",  # 壳体法兰  #外头盖侧法兰
    "法兰材料腐蚀裕量管前左": "3",  # 壳程
    "法兰类型壳后右": "整体法兰2",  # 外头盖法兰
    "法兰材料类型壳后右": "",  # 外头盖法兰
    "法兰材料牌号壳后右": "",  # 外头盖法兰
    "法兰材料腐蚀裕量壳后右": "3",  # 壳程
    "覆层厚度管前左": "0",  # 壳体法兰 #外头盖侧法兰
    "覆层厚度壳后右": "0",  # 外头盖法兰
    "对接元件覆层厚度管前左": "1.5",  # 壳体圆筒
    "对接元件覆层厚度壳后右": "1.6",  # 外头盖圆筒
    "平盖序号": "9",  # 无
    "平盖直径": "1000",  # 壳程，公称直径
    "纵向焊接接头系数": "1",  # 壳程
    "是否为圆形平盖": "是",  # 无
    "平盖材料类型": "钢锻件",  # 无
    "平盖材料牌号": "16Mn",  # 无
    "平盖分程隔板槽深度": "6",  # 无
    "平盖材料腐蚀裕量": "0.1",  # 无
    "平盖名义厚度": "96",  # 无
    "垫片名义外径": "0",  # 外头盖垫片
    "垫片名义内径": "0",  # 外头盖垫片
    "螺栓中心圆直径": "1200",  # 无
    "螺栓材料牌号": "35CrMo",  # 螺柱（外头盖侧法兰）
    "螺栓公称直径": "M16",  # 无
    "螺栓数量": "60",  # 无
    "螺栓根径": "0",  # 无
    # "垫片序号": "1",#无
    "垫片材料牌号": "复合柔性石墨波齿金属板(不锈钢)",  # 外头盖垫片
    "m": "3",  # 外头盖垫片，垫片系数m
    "y": "50",  # 外头盖垫片，垫片比压力y
    "垫片厚度": "3",  # 外头盖垫片
    "垫片有效外径": "0",  # 外头盖垫片
    "垫片有效内径": "0",  # 外头盖垫片
    "分程隔板与垫片接触面面积": "0",  # 无
    "垫片代号": "2.1",  # 无
    "隔条位置尺寸": "0",  # 布管，隔条位置尺寸
    "介质情况": "毒性",  # 壳程，介质特性（爆炸危险程度）+管程和壳程，介质特性（毒性危害程度）
    "垫片标准号": "GB/T 29463-2023",  # 外头盖垫片
    "垫片实际密封宽度": "0",  # 无
    "分程隔板槽宽度": ""  # 浮动管板
}

tougai_falan = {
    "换热器型号": "AEU",
    "壳程液柱密度": "1",
    "管程液柱密度": "1",
    "壳程液柱静压力": "0",
    "管程液柱静压力": "0",
    "压紧面形状序号": "1a",
    "法兰是否考虑腐蚀裕量": "是",
    "法兰压紧面压紧宽度ω": "0",
    "轴向外力": "0",
    "外力矩": "0",
    "法兰类型": "整体法兰2",
    "法兰材料类型": "",
    "法兰材料牌号": "",
    "法兰材料腐蚀裕量": "3",
    "法兰颈部大端有效厚度": "26",
    "法兰颈部小端有效厚度": "16",
    "法兰名义内径": "0",
    "法兰名义外径": "0",
    "法兰名义厚度": "65",
    "法兰颈部高度": "35",
    "覆层厚度": "0",
    "管程还是壳程": "管程",
    "法兰为夹持法兰": "是",
    "法兰位置": "壳体法兰",
    "圆筒名义厚度": "10",
    "圆筒有效厚度": "8",
    "圆筒名义内径": "800",
    "圆筒名义外径": "1020",
    "圆筒材料类型": "板材",
    "圆筒材料牌号": "Q345R",
    "焊缝高度": "0",
    "焊缝长度": "0",
    "焊缝深度": "0",
    "法兰种类": "整体法兰2",
    "公称直径管前左": "1000",
    "公称直径壳后右": "1200",
    "对接元件管前左材料类型": "板材",
    "对接元件壳后右材料类型": "板材",
    "对接元件管前左材料牌号": "Q345R",
    "对接元件壳后右材料牌号": "Q345R",
    "是否带分程隔板管前左": "是",
    "是否带分程隔板壳后右": "是",
    "法兰类型管前左": "整体法兰2",
    "法兰材料类型管前左": "",
    "法兰材料牌号管前左": "",
    "法兰材料腐蚀裕量管前左": "3",
    "法兰类型壳后右": "整体法兰2",
    "法兰材料类型壳后右": "",
    "法兰材料牌号壳后右": "",
    "法兰材料腐蚀裕量壳后右": "3",
    "覆层厚度管前左": "0",
    "覆层厚度壳后右": "0",
    "对接元件覆层厚度管前左": "1.5",
    "对接元件覆层厚度壳后右": "1.6",
    "平盖序号": "9",
    "平盖直径": "1000",
    "纵向焊接接头系数": "1",
    "是否为圆形平盖": "是",
    "平盖材料类型": "钢锻件",
    "平盖材料牌号": "16Mn",
    "平盖分程隔板槽深度": "6",
    "平盖材料腐蚀裕量": "0.1",
    "平盖名义厚度": "96",
    "垫片名义外径": "0",
    "垫片名义内径": "0",
    "螺栓中心圆直径": "1200",
    "螺栓材料牌号": "35CrMo",
    "螺栓公称直径": "M16",
    "螺栓数量": "60",
    "螺栓根径": "0",
    # "垫片序号": "1",
    "垫片材料牌号": "复合柔性石墨波齿金属板(不锈钢)",
    "m": "3",
    "y": "50",
    "垫片厚度": "3",
    "垫片有效外径": "0",
    "垫片有效内径": "0",
    "分程隔板与垫片接触面面积": "0",
    "垫片代号": "2.1",
    "隔条位置尺寸": "0",
    "介质情况": "毒性",
    "垫片标准号": "GB/T 29463-2023",
    "垫片实际密封宽度": "0",
    "分程隔板槽宽度": "2",

}

guangxiang_pinggai = {
    "分程隔板槽宽度": "2",

    "换热器型号": "BEU",
    "壳程液柱密度": "1",
    "管程液柱密度": "1",
    "壳程液柱静压力": "0",
    "管程液柱静压力": "0",
    "压紧面形状序号": "1a",
    "法兰是否考虑腐蚀裕量": "是",
    "法兰压紧面压紧宽度ω": "0",
    "轴向外力": "0",
    "外力矩": "0",
    "法兰类型": "松式法兰4",
    "法兰材料类型": "",
    "法兰材料牌号": "",
    "法兰材料腐蚀裕量": "3",
    "法兰颈部大端有效厚度": "26",
    "法兰颈部小端有效厚度": "16",
    "法兰名义内径": "0",
    "法兰名义外径": "0",
    "法兰名义厚度": "65",
    "法兰颈部高度": "35",
    "覆层厚度": "0",
    "管程还是壳程": "管程",
    "法兰为夹持法兰": "是",
    "法兰位置": "管箱法兰",
    "圆筒名义厚度": "10",
    "圆筒有效厚度": "8",
    "圆筒名义内径": "0",
    "圆筒名义外径": "0",
    "圆筒材料类型": "",
    "圆筒材料牌号": "",
    "焊缝高度": "0",
    "焊缝长度": "10",
    "焊缝深度": "0",
    "法兰种类": "整体法兰2",
    "介质情况": "毒性",
    "公称直径管前左": "",
    "公称直径壳后右": "",
    "对接元件管前左材料类型": "无",
    "对接元件壳后右材料类型": "",
    "对接元件管前左材料牌号": "无",
    "对接元件壳后右材料牌号": "",
    "是否带分程隔板管前左": "是",
    "是否带分程隔板壳后右": "是",
    "法兰类型管前左": "整体法兰2",
    "法兰材料类型管前左": "",
    "法兰材料牌号管前左": "16Mn",
    "法兰材料腐蚀裕量管前左": 0,
    "法兰类型壳后右": "整体法兰2",
    "法兰材料类型壳后右": "整体法兰2",
    "法兰材料牌号壳后右": "16Mn",
    "法兰材料腐蚀裕量壳后右": "3",
    "覆层厚度管前左": "0",
    "覆层厚度壳后右": "0",
    "对接元件覆层厚度管前左": 0,
    "对接元件覆层厚度壳后右": "1.6",
    "垫片名义外径": "0",
    "垫片名义内径": "0",
    "平盖序号": "9",
    "纵向焊接接头系数": "1",
    "平盖直径": "1000",
    "是否为圆形平盖": "是",
    "平盖材料类型": "钢锻件",
    "平盖材料牌号": "16Mn",
    "平盖分程隔板槽深度": "6",
    "平盖材料腐蚀裕量": "0.1",
    "平盖名义厚度": "96",
    "螺栓中心圆直径": "1200",
    "螺栓材料牌号": "35CrMo",
    "螺栓公称直径": "M16",
    "螺栓数量": "60",
    "螺栓根径": "0",
    # "垫片序号": "1",
    "垫片材料牌号": "复合柔性石墨波齿金属板(不锈钢)",
    "m": "3",
    "y": "50",
    "垫片厚度": "3",
    "垫片有效外径": "0",
    "垫片有效内径": "0",
    "分程隔板与垫片接触面面积": "0",
    "垫片代号": "2.1",
    "隔条位置尺寸": "0",
    "垫片标准号": "GB/T 29463-2023",
    "垫片实际密封宽度": "0",
}
waitougai_falan = reset_values_to_zero(waitougai_falan)
waitougaice_falan = reset_values_to_zero(waitougaice_falan)
tougai_falan = reset_values_to_zero(tougai_falan)
guangxiang_pinggai = reset_values_to_zero(guangxiang_pinggai)

print(waitougai_falan)
print(waitougaice_falan)
print(tougai_falan)
print(guangxiang_pinggai)
